{
  "personal": {
    "name": "Vinay Koirala",
    "title": "IT LECTURER & COMPUTER ENGINEERING GRADUATE",
    "email": "koiralavinay@gmail.com",
    "github": "github.com/v-eenay",
    "linkedin": "linkedin.com/in/veenay"
  },
  "about": {
    "description": "Versatile technology enthusiast with a unique blend of technical expertise and creative expression. My background in computer science engineering and business administration provides me with a holistic perspective on technology and its applications. When I'm not immersed in code, you'll find me on stage, where I channel my passion for theatrical arts.",
    "quote": "At the intersection of logic and creativity lies true innovation.",
    "highlights": [
      "Computer Science Engineer with an MBA",
      "Theater performer exploring the art of expression",
      "Constantly exploring emerging technologies",
      "Ask me about the parallels between coding and performing arts"
    ]
  },
  "skills": {
    "languages": ["C#", "Python", "JavaScript", "TypeScript", "Java", "C++", "Dart"],
    "frontend": ["HTML5", "CSS3", "SASS", "Bootstrap", "Tailwind CSS", "jQuery"],
    "frontendFrameworks": ["React", "Next.js", "Angular", "Vue.js", "Redux", "Blazor"],
    "backend": ["Node.js", "Express.js", "Django", "Flask", "Spring", "ASP.NET", ".NET"],
    "mobile": ["Flutter", "React Native", "Xamarin", "Android", "MAUI"],
    "databases": ["MySQL", "PostgreSQL", "SQL Server", "MongoDB", "Firebase", "Redis", "GraphQL"],
    "devops": ["Git", "GitHub", "Docker", "Kubernetes", "AWS", "Azure"],
    "tools": ["VS Code", "Visual Studio", "IntelliJ", "Android Studio", "Postman"],
    "design": ["Figma", "Adobe Photoshop", "Adobe Illustrator", "Canva"],
    "exploring": ["TensorFlow", "PyTorch", "Blockchain", "Web3.js", "Rust", "Go"]
  },
  "theater": {
    "description": "My background in theater has enhanced my professional capabilities, particularly in communication, presentation, and audience engagement - skills that are invaluable in the technology sector. Theater experience has developed my ability to collaborate effectively and deliver compelling presentations.",
    "quote": "All the world's a stage, and all the men and women merely players.",
    "quoteAuthor": "William Shakespeare",
    "additionalInfo": "The methodical approach required in theatrical productions parallels software development practices, emphasizing precision, iteration, and team coordination. Both disciplines require structured creativity and meticulous attention to detail."
  },
  "projects": [
    {
      "id": 1,
      "name": "Terminal Portfolio",
      "description": "An interactive terminal-based portfolio showcasing my skills, projects, and background. Built using HTML, CSS, and JavaScript with jQuery Terminal.",
      "features": [
        "Interactive command-line interface",
        "Custom styling with Tokyo Night theme",
        "Responsive design for all devices",
        "Easy navigation through various sections"
      ],
      "repo": "terminal-portfolio"
    },
    {
      "id": 2,
      "name": "Automated Metadata Extraction and Reporting Tool (AMERT)",
      "description": "A Python-powered tool designed to extract metadata from PDF and DOCX files within nested folder structures, generating organized Excel reports. Ideal for managing coursework submissions or research documents.",
      "features": [
        "Metadata extraction from PDF/DOCX files (author, title, creation date, etc.)",
        "Recursive folder scanning for deep directory structures",
        "Excel report generation with organized metadata",
        "Error logging for robust issue tracking",
        "Cross-platform compatibility (Windows, macOS, Linux)"
      ],
      "repo": "Automated-Metadata-Extraction-and-Reporting-Tool-AMERT-"
    },
    {
      "id": 3,
      "name": "SkillForge E-Learning Platform",
      "description": "A modern e-learning platform offering high-quality educational content from industry experts, featuring an intuitive interface for learners and instructors. Built with Java EE, Bootstrap, and MySQL for robust course management and user engagement.",
      "features": [
        "User authentication with role-based access control (Admin, Instructor, Student)",
        "Course creation, editing, and management with media support",
        "Responsive design with modern dashboards for all user roles",
        "Admin tools for user management and platform analytics",
        "Planned features: interactive quizzes, payment system, and social features"
      ],
      "repo": "skillforge-elearning"
    },
    {
      "id": 4,
      "name": "Java Servlet REST API",
      "description": "An experimental Java-based RESTful API for a Todo application, utilizing Jakarta Servlet API and Gson for JSON processing. This project explores CRUD operations on Todo items, despite Servlets not being naturally suited for API development.",
      "features": [
        "CRUD operations for Todo items (Create, Read, Update, Delete)",
        "JSON processing with Gson",
        "MySQL database integration for persistent storage",
        "RESTful endpoints for managing Todo items",
        "Toggle status functionality via PATCH requests"
      ],
      "repo": "java-servlet-rest-api"
    },
    {
      "id": 5,
      "name": "Student Folder Management System",
      "description": "A Python-based automation tool that organizes student data from Excel sheets into a hierarchical folder structure, creating personalized Excel files for each student based on sections and group assignments.",
      "features": [
        "Automated creation of section and group folders",
        "Generation of individual student Excel files with pre-filled information",
        "Case-insensitive name matching for accurate student grouping",
        "Comprehensive logging for process tracking and troubleshooting",
        "Support for Excel file handling with openpyxl"
      ],
      "repo": "Student-Folder-Management-System"
    },
    {
      "id": 6,
      "name": "Online Digital Library",
      "description": "A digital library system developed in 2018 for B.Tech in Computer Science and Engineering, utilizing Java, Spring Framework, and Hibernate for back-end development, MySQL for database management, and HTML, CSS, and JavaScript for an accessible user interface.",
      "features": [
        "Back-end development with Java, Spring Framework, and Hibernate",
        "MySQL database for efficient resource management",
        "User-friendly interface built with HTML, CSS, and JavaScript",
        "Enhanced accessibility for educational resources"
      ],
      "repo": null
    },
    {
      "id": 7,
      "name": "The Impact of Personalized Marketing on Growing Advertising Reach of Local Business",
      "description": "A 2022 MBA research project analyzing the effectiveness of personalized marketing strategies on enhancing the advertising reach of local businesses, offering insights for optimizing marketing approaches based on customer engagement data.",
      "features": [
        "Analysis of personalized marketing effectiveness",
        "Insights derived from customer engagement data",
        "Recommendations for optimizing local business marketing strategies"
      ],
      "repo": null
    }
  ],
  "contact": {
    "email": "koiralavinay@gmail.com",
    "github": "github.com/v-eenay",
    "linkedin": "linkedin.com/in/veenay",
    "quote": "Whether writing code or performing on stage, I'm always looking to create something meaningful. Let's collaborate and build something extraordinary together."
  },
  "commands": [
    {
      "name": "help",
      "description": "Show this help message"
    },
    {
      "name": "about",
      "description": "Learn about me"
    },
    {
      "name": "cv",
      "description": "View my curriculum vitae"
    },
    {
      "name": "skills",
      "description": "See my technical skills"
    },
    {
      "name": "tech",
      "description": "View my complete tech stack"
    },
    {
      "name": "projects",
      "description": "View my projects"
    },
    {
      "name": "teaching",
      "description": "Learn about my teaching experience"
    },
    {
      "name": "achievements",
      "description": "View my awards and achievements"
    },
    {
      "name": "theater",
      "description": "Learn about my theater background"
    },
    {
      "name": "contact",
      "description": "Get my contact information"
    },
    {
      "name": "clear",
      "description": "Clear the terminal"
    }
  ],
  "github": {
    "username": "v-eenay",
    "featuredRepo": "terminal-portfolio"
  },
  "cv": {
    "summary": "Versatile IT lecturer with an MBA and B.Tech in Computer Science Engineering, experienced in both academic and business settings. Committed to fostering a dynamic learning environment that integrates technology and innovative practices across disciplines. Passionate about empowering students and professionals through collaborative engagement and continuous skill development.",
    "experience": [
      {
        "title": "IT Lecturer",
        "company": "Itahari International College",
        "location": "Itahari",
        "period": "July, 2023 - Present",
        "description": "Currently teaching Introduction to Information Systems, covering HTML, CSS, JavaScript, and MySQL, as well as Fundamentals of Computing, focusing on Python programming. Conducting enrichment classes on Flutter for mobile development and contributing to the content upgrade program to enhance the curriculum for future students."
      },
      {
        "title": "Teacher",
        "company": "Gokyo International School",
        "location": "Itahari",
        "period": "June, 2022 - April, 2023",
        "description": "Delivered engaging computer science instruction, covering programming, software applications, and digital literacy. Developed tailored lesson plans, assessed student performance, and created a supportive environment to foster students' interest and skills in technology."
      },
      {
        "title": "Computer Instructor",
        "company": "Good Luck Education and Training Center",
        "location": "Itahari",
        "period": "February, 2021 - February, 2022",
        "description": "Delivered comprehensive computer education to students, covering essential software and programming skills. Developed curriculum materials, assessed student progress, and fostered a collaborative learning environment to enhance digital literacy and technical proficiency."
      },
      {
        "title": "Production Manager",
        "company": "Namaste F.M.",
        "location": "Itahari",
        "period": "February, 2019 - January, 2021",
        "description": "Oversaw the production and broadcasting operations, ensuring high-quality content delivery and adherence to schedules. Managed a team of technical and creative staff, coordinated programming, and optimized processes to enhance listener engagement and station performance."
      }
    ],
    "education": [
      {
        "degree": "M.B.A",
        "institution": "Lincoln University, Malaysia",
        "field": "Business Administration",
        "period": "March, 2019 - January, 2022"
      },
      {
        "degree": "B.Tech.",
        "institution": "Aryabhatta Knowledge University, India",
        "field": "Computer Science and Engineering",
        "period": "October, 2014 - May, 2018"
      }
    ],
    "research": [
      {
        "title": "Online Digital Library",
        "year": "2018",
        "description": "Conducted for the partial fulfillment of the B.Tech in Computer Science and Engineering. Developed a digital library system using Java, Spring Framework, and Hibernate for back-end development, along with MySQL for database management. The user interface was created with HTML, CSS, and JavaScript to enhance educational resource accessibility."
      },
      {
        "title": "The Impact of Personalized Marketing on Growing Advertising Reach of Local Business",
        "year": "2022",
        "description": "Undertaken for the partial fulfillment of the MBA. Analysed the effectiveness of personalised marketing strategies on local business advertising reach, providing insights for optimising marketing approaches based on customer engagement data."
      }
    ],
    "teaching": [
      {
        "course": "Introduction to Information Systems",
        "institution": "Itahari International College",
        "description": "Comprehensive course covering web technologies including HTML, CSS, JavaScript, and database fundamentals with MySQL."
      },
      {
        "course": "Fundamentals of Computing",
        "institution": "Itahari International College",
        "description": "Core computer science course with focus on Python programming, algorithms, and computational thinking."
      },
      {
        "course": "Flutter Development Workshop",
        "institution": "Itahari International College",
        "description": "Enrichment program teaching cross-platform mobile app development using Flutter and Dart."
      }
    ],
    "projects": [
      {
        "title": "Terminal Portfolio",
        "description": "Interactive command-line interface portfolio built with HTML, CSS, and JavaScript featuring responsive design and custom Tokyo Night theme.",
        "technologies": ["HTML5", "CSS3", "JavaScript", "jQuery Terminal"]
      },
      {
        "title": "Student Management System",
        "description": "Comprehensive system for educational institutions to manage student records, attendance, and performance analytics.",
        "technologies": ["Java", "Spring Boot", "MySQL", "Thymeleaf", "Bootstrap"]
      },
      {
        "title": "E-Learning Platform",
        "description": "Web-based learning management system with video content delivery, interactive quizzes, and progress tracking.",
        "technologies": ["React", "Node.js", "MongoDB", "Express", "AWS S3"]
      }
    ],
    "achievements": [
      {
        "title": "Best Teaching Innovation Award",
        "issuer": "Itahari International College",
        "year": "2024",
        "description": "Recognized for implementing innovative teaching methodologies that significantly improved student engagement and learning outcomes."
      },
      {
        "title": "Outstanding Academic Performance",
        "issuer": "Aryabhatta Knowledge University",
        "year": "2018",
        "description": "Graduated with distinction in B.Tech Computer Science and Engineering program."
      },
      {
        "title": "Community Tech Educator Award",
        "issuer": "Itahari Municipality",
        "year": "2022",
        "description": "Honored for conducting free programming workshops for underprivileged students in the community."
      }
    ],
    "professional_development": [
      {
        "title": "Advanced Web Development Bootcamp",
        "provider": "Udemy",
        "year": "2023",
        "description": "Comprehensive training in modern web development technologies including React, Node.js, and responsive design principles."
      },
      {
        "title": "Machine Learning Fundamentals",
        "provider": "Coursera (Stanford University)",
        "year": "2022",
        "description": "In-depth course covering core machine learning algorithms, data preprocessing, and model evaluation techniques."
      },
      {
        "title": "Educational Technology Integration",
        "provider": "EdX (MIT)",
        "year": "2023",
        "description": "Specialized training in integrating technology tools and platforms into educational curricula for enhanced learning experiences."
      }
    ]
  }
}
